export default {
    /**           商户APP              **/
    /***********************************/

// 账号不存在
    11:'请登录',
    17: '参数缺失',
    22:'验证码错误',
    // 37:'子账户开通失败',
// 账号不存在
    10605: '店铺不存在',
    10606: '店铺已结存在',
    10611:'线下店铺已存在',
    11106:'审批内容未通过，不能修改审批内容',
    60015:'用户名格式不正确，必须用户名 6-16 不能包含中文 a-z 0-9 A-Z 不允许数字开头',
    // 账号不存在
    80000: '账号不存在',
// 密码不正确
    80001: '密码不正确',
// 账号已停用
    80002: '账号已停用',
// 该账号未赋予系统角色
    80003: '该账号未赋予系统角色',
//推广员信息为空
    80004: '推广员信息为空',
//推广员不存在
    80005: '推广员不存在',
//省区总不存在
    80006: '省区总不存在',
//省区总信息为空
    80007: '省区总信息为空',
//合作商不存在
    80008: '合作商不存在',
//合作商信息为空
    80009: '合作商信息为空',
//管理人员账号已存在
    80010: '管理人员账号已存在',
// 未获取到推广员角色
    80011: '未获取到推广员角色',
//推广员信息已存在
    80012: '推广员信息已存在',
//合作商信息已存在
    80013: '合作商信息已存在',
// 未获取到合作商角色
    80015: '未获取到合作商角色',
//省区总信息已存在
    80016: '省区总信息已存在',
// 未获取到省区总角色
    80017: '未获取到省区总角色',
// 未获取到管理者角色
    80018: '未获取到管理者角色',
// 账号不允许登录
    80019: '账号不允许登录',
// 账号已停用
    80020: '账号已停用',
    /** 挂靠区域必须为区 **/
    80021: '挂靠区域必须为区',
    /** 挂靠区域必须为省 **/
    80022: '挂靠区域必须为省',
    /**所属辖区不能为空**/
    80023: '所属辖区不能为空',
    /**所属辖区已经被占领**/
    80025: '所属辖区已经被占领',
//省区总不需要填写线索表
    80024: '所属辖区超过上级范围',
    /**所属辖区超过上级范围**/
    80026: '所属辖区超过上级范围',
    80027:'要删除的辖区不能为空',
    80028:'省区总，您还没有合作商',
    80029:'合作商不属于省区总'
}
